Revit 2027 API
PipeFittingAndAccessoryPressureDropUIDataItem.GetEntity Method
 Returns the entity set by UI server. or an invalid entity otherwise.
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Entity GetEntity()
Public Function GetEntity As Entity
public:
Entity^ GetEntity()
member GetEntity : unit -> Entity
Return Value
Entity
 The returned Entity.
Remarks
 The Entity that is returned is a copy of the stored data (with copy-on-write optimization). Modifying it is allowed (even with restricted write), but to save your changes you must call SetEntity.
See Also
Reference
PipeFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Plumbing Namespace